app/views/urls/index.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."url_id" = ?  [["url_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."url_id" = ?  [["url_id", 1]]
---

  <strong>質問</strong>(<%= url.questions.count %>)
  <% url.questions.each do |questions| %>