app/views/urls/show.html.erb

  <h1><%= @url.url %></h1>
  <strong>質問</strong>(<%= @url.questions.count %>)
  <% @url.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."url_id" = ?  [["url_id", 17]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."url_id" = ?  [["url_id", 17]]