app/controllers/questions_controller.rb

  def create
    @url = Url.find(params[:url_id])
    @question = @url.questions.create(question_params)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "questions" ("content", "url_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "aaaaaa"], ["url_id", 2], ["created_at", "2018-10-26 00:18:07.985152"], ["updated_at", "2018-10-26 00:18:07.985152"]]

  def destroy
    @url = Url.find(params[:url_id])
    @question = @url.questions.find(params[:id])
    @question.destroy
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."url_id" = ? AND "questions"."id" = ? LIMIT ?  [["url_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]

  def increment_yes
    @url = Url.find(params[:url_id])
    @question = @url.questions.find(params[:question_id])
    @question.increment(:yes)
    @question.save
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."url_id" = ? AND "questions"."id" = ? LIMIT ?  [["url_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "yes" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["yes", 1], ["updated_at", "2018-10-26 04:39:31.955225"], ["id", 1]]

  def increment_no
    @url = Url.find(params[:url_id])
    @question = @url.questions.find(params[:question_id])
    @question.increment(:no)
    @question.save
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."url_id" = ? AND "questions"."id" = ? LIMIT ?  [["url_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "no" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["no", 1], ["updated_at", "2018-10-26 04:39:58.897569"], ["id", 1]]