app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls" WHERE (url = 'a')
SELECT  1 AS one FROM "urls" WHERE "urls"."url" = ? LIMIT ?  [["url", "a"], ["LIMIT", 1]]
SELECT "urls".* FROM "urls" WHERE (url = 'https://qiita.com')
INSERT INTO "urls" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "https://qiita.com"], ["created_at", "2018-10-26 05:09:46.705545"], ["updated_at", "2018-10-26 05:09:46.705545"]]
SELECT  "urls".* FROM "urls" WHERE (url = 'qqqqqqq') ORDER BY "urls"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE (url = 'https://qiita.com') ORDER BY "urls"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if url_request(params[:search])
      @urls = Url.search(params[:search])
      if @urls.blank?
        Url.create(url: params[:search] )
        @urls = Url.search(params[:search])
      end
      redirect_to url_path(@urls.first.id)

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def show
    @url = Url.find(params[:id])